vePic/app/controllers/images_controller.rb

  def index
    @images = Image.all
---
SELECT * FROM "images"

  def show
    @image = Image.find(params[:id])
---
SELECT * FROM "images" WHERE ("images"."id" = 10)