vePic/app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT * FROM "posts"

  def create
    @topic = Topic.find(params[:topic_id])
    @post = @topic.posts.create!(params[:post])
---
SELECT * FROM "topics" WHERE ("topics"."id" = 1)
INSERT INTO "posts" ("created_at", "body", "updated_at", "topic_id") VALUES('2010-04-20 18:35:09', 'Sked', '2010-04-20 18:35:09', NULL)