vePic/app/controllers/slideshows_controller.rb

SELECT * FROM "slideshows"
---
  def index
    @slideshows = Slideshow.all

SELECT * FROM "slideshows" WHERE ("slideshows"."id" = 1)
---
  def show
    @slideshow = Slideshow.find(params[:id])

SELECT * FROM "slideshows" WHERE ("slideshows"."id" = 1)
---
  def edit
    @slideshow = Slideshow.find(params[:id])

INSERT INTO "slideshows" ("created_at", "sequence", "updated_at", "topic_id") VALUES('2010-05-13 22:27:44', NULL, '2010-05-13 22:27:44', NULL)
SELECT * FROM "slides" WHERE ("slides"."id" = 15)
UPDATE "slides" SET "updated_at" = '2010-05-13 21:01:18', "slideshow_id" = 1 WHERE "id" = 15
---
  def create
    @slideshow = Slideshow.new(params[:slideshow])
    @slideshow.slides << Slide.find(params[:slide_pick])
    @slideshow.sequence = params[:slide_pick].to_s

    respond_to do |format|
      if @slideshow.save

SELECT * FROM "slideshows" WHERE ("slideshows"."id" = 1)
SELECT * FROM "slides" WHERE ("slides"."id" = 4)
UPDATE "slides" SET "updated_at" = '2010-05-13 21:02:53', "slideshow_id" = 1 WHERE "id" = 4
UPDATE "slideshows" SET "updated_at" = '2010-05-13 22:28:59', "sequence" = '4' WHERE "id" = 4
---
  def update
    @slideshow = Slideshow.find(params[:id])
    seq = @slideshow.sequence.split(",")
    if params[:slide_pick]
      @slideshow.slides << Slide.find(params[:slide_pick])
      seq.push params[:slide_pick].to_s

SELECT * FROM "slideshows" WHERE ("slideshows"."id" = 2)
DELETE FROM "slideshows" WHERE "id" = 2
---
  def destroy
    @slideshow = Slideshow.find(params[:id])
    @slideshow.destroy