vePic/app/controllers/slides_controller.rb

SELECT * FROM "slides"
---
  def index
    @slides = Slide.all

SELECT * FROM "slides" WHERE ("slides"."id" = 1)
---
  def show
    @slide = Slide.find(params[:id])

SELECT * FROM "images" WHERE ("images"."id" = 0)
---
  def new
    @slide = Slide.new
    @image = Image.find params['image']

SELECT * FROM "slides" WHERE ("slides"."id" = 1)
---
  def edit
    @slide = Slide.find(params[:id])

SELECT * FROM "images" WHERE ("images"."id" = 39)
INSERT INTO "slides" ("slideshow_id", "created_at", "title", "body", "updated_at") VALUES(NULL, '2010-05-13 19:33:37', 'wat', 'waaaat', '2010-05-13 19:33:37')
UPDATE "images" SET "updated_at" = '2010-05-13 20:43:12', "slide_id" = 15 WHERE "id" = 39
---
  def create
    @slide = Slide.new(params[:slide])
    @slide.image = Image.find params[:image_id]

    respond_to do |format|
      if @slide.save

SELECT * FROM "slides" WHERE ("slides"."id" = 4)
UPDATE "slides" SET "updated_at" = '2010-05-13 20:13:48', "title" = 'Sakana', "body" = 'Japanska för dålig.' WHERE "id" = 4
---
  def update
    @slide = Slide.find(params[:id])

    respond_to do |format|
      if @slide.update_attributes(params[:slide])

SELECT * FROM "slides" WHERE ("slides"."id" = 3)
DELETE FROM "slides" WHERE "id" = 3
---
  def destroy
    @slide = Slide.find(params[:id])
    @slide.destroy