vePic/app/controllers/upload_controller.rb

INSERT INTO "slides" ("slideshow_id", "created_at", "title", "body", "updated_at") VALUES(NULL, '2010-05-06 13:21:29', 'Pew', 'Per äger', '2010-05-06 13:21:29')
INSERT INTO "images" ("created_at", "slide_id", "title", "author", "updated_at", "path") VALUES('2010-05-06 12:52:17', 1, 'Erik äger.', 'Erik', '2010-05-06 12:52:17', 7371)
---
  def uploadFile
    slide = Slide.new
    slide.body = "Per äger"
    slide.title = "Pew"
    slide.save
    path = DataFile.save(params[:upload])
    image = Image.new
    image.path = path
    image.title = "Erik äger."
    image.author = "Erik"
    image.slide_id = 1
    image.save